MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256GM304/mcu.h
#define AD2CSSH AD2CSSH
extern volatile uint16_t AD2CSSH __attribute__((__sfr__));
typedef struct tagAD2CSSHBITS {
  uint16_t CSS16:1;
  uint16_t CSS17:1;
  uint16_t CSS18:1;
  uint16_t CSS19:1;
  uint16_t CSS20:1;
  uint16_t CSS21:1;
  uint16_t CSS22:1;
  uint16_t CSS23:1;
  uint16_t CSS24:1;
  uint16_t CSS25:1;
  uint16_t CSS26:1;
  uint16_t CSS27:1;
  uint16_t CSS28:1;
  uint16_t CSS29:1;
  uint16_t CSS30:1;
  uint16_t CSS31:1;
} AD2CSSHBITS;
extern volatile AD2CSSHBITS AD2CSSHbits __attribute__((__sfr__));

#define AD2CSSL AD2CSSL
extern volatile uint16_t AD2CSSL __attribute__((__sfr__));
typedef struct tagAD2CSSLBITS {
  uint16_t CSS0:1;
  uint16_t CSS1:1;
  uint16_t CSS2:1;
  uint16_t CSS3:1;
  uint16_t CSS4:1;
  uint16_t CSS5:1;
  uint16_t CSS6:1;
  uint16_t CSS7:1;
  uint16_t CSS8:1;
  uint16_t CSS9:1;
  uint16_t CSS10:1;
  uint16_t CSS11:1;
  uint16_t CSS12:1;
  uint16_t CSS13:1;
  uint16_t CSS14:1;
  uint16_t CSS15:1;
} AD2CSSLBITS;
extern volatile AD2CSSLBITS AD2CSSLbits __attribute__((__sfr__));

#define AD2CON4 AD2CON4
extern volatile uint16_t AD2CON4 __attribute__((__sfr__));
__extension__ typedef struct tagAD2CON4BITS {
  union {
    struct {
      uint16_t DMABL:3;
      uint16_t :5;
      uint16_t ADDMAEN:1;
    };
    struct {
      uint16_t DMABL0:1;
      uint16_t DMABL1:1;
      uint16_t DMABL2:1;
    };
  };
} AD2CON4BITS;
extern volatile AD2CON4BITS AD2CON4bits __attribute__((__sfr__));

#define QEI2CON QEI2CON
extern volatile uint16_t QEI2CON __attribute__((__sfr__));
typedef struct tagQEI2CONBITS {
  uint16_t CCM:2;
  uint16_t GATEN:1;
  uint16_t CNTPOL:1;
  uint16_t INTDIV:3;
  uint16_t :1;
  uint16_t IMV:2;
  uint16_t PIMOD:3;
  uint16_t QEISIDL:1;
  uint16_t :1;
  uint16_t QEIEN:1;
} QEI2CONBITS;
extern volatile QEI2CONBITS QEI2CONbits __attribute__((__sfr__));

#define QEI2IOC QEI2IOC
extern volatile uint16_t QEI2IOC __attribute__((__sfr__));
typedef struct tagQEI2IOCBITS {
  uint16_t QEA:1;
  uint16_t QEB:1;
  uint16_t INDEX:1;
  uint16_t HOME:1;
  uint16_t QEAPOL:1;
  uint16_t QEBPOL:1;
  uint16_t IDXPOL:1;
  uint16_t HOMPOL:1;
  uint16_t SWPAB:1;
  uint16_t OUTFNC:2;
  uint16_t QFDIV:3;
  uint16_t FLTREN:1;
  uint16_t QCAPEN:1;
} QEI2IOCBITS;
extern volatile QEI2IOCBITS QEI2IOCbits __attribute__((__sfr__));

#define QEI2STAT QEI2STAT
extern volatile uint16_t QEI2STAT __attribute__((__sfr__));
typedef struct tagQEI2STATBITS {
  uint16_t IDXIEN:1;
  uint16_t IDXIRQ:1;
  uint16_t HOMIEN:1;
  uint16_t HOMIRQ:1;
  uint16_t VELOVIEN:1;
  uint16_t VELOVIRQ:1;
  uint16_t PCIIEN:1;
  uint16_t PCIIRQ:1;
  uint16_t POSOVIEN:1;
  uint16_t POSOVIRQ:1;
  uint16_t PCLEQIEN:1;
  uint16_t PCLEQIRQ:1;
  uint16_t PCHEQIEN:1;
  uint16_t PCHEQIRQ:1;
} QEI2STATBITS;
extern volatile QEI2STATBITS QEI2STATbits __attribute__((__sfr__));

#define POS2CNTL POS2CNTL
extern volatile uint16_t POS2CNTL __attribute__((__sfr__));
#define POS2CNTH POS2CNTH
extern volatile uint16_t POS2CNTH __attribute__((__sfr__));
#define POS2HLD POS2HLD
extern volatile uint16_t POS2HLD __attribute__((__sfr__));
#define VEL2CNT VEL2CNT
extern volatile uint16_t VEL2CNT __attribute__((__sfr__));
#define INT2TMRL INT2TMRL
extern volatile uint16_t INT2TMRL __attribute__((__sfr__));
#define INT2TMRH INT2TMRH
extern volatile uint16_t INT2TMRH __attribute__((__sfr__));
#define INT2HLDL INT2HLDL
extern volatile uint16_t INT2HLDL __attribute__((__sfr__));
#define INT2HLDH INT2HLDH
extern volatile uint16_t INT2HLDH __attribute__((__sfr__));
#define INDX2CNTL INDX2CNTL
extern volatile uint16_t INDX2CNTL __attribute__((__sfr__));
#define INDX2CNTH INDX2CNTH
extern volatile uint16_t INDX2CNTH __attribute__((__sfr__));
#define INDX2HLD INDX2HLD
extern volatile uint16_t INDX2HLD __attribute__((__sfr__));
#define QEI2GECL QEI2GECL
extern volatile uint16_t QEI2GECL __attribute__((__sfr__));
#define QEI2ICL QEI2ICL
extern volatile uint16_t QEI2ICL __attribute__((__sfr__));
#define QEI2GECH QEI2GECH
extern volatile uint16_t QEI2GECH __attribute__((__sfr__));
#define QEI2ICH QEI2ICH
extern volatile uint16_t QEI2ICH __attribute__((__sfr__));
#define QEI2LECL QEI2LECL
extern volatile uint16_t QEI2LECL __attribute__((__sfr__));
#define QEI2LECH QEI2LECH
extern volatile uint16_t QEI2LECH __attribute__((__sfr__));
#define ALRMVAL ALRMVAL
extern volatile uint16_t ALRMVAL __attribute__((__sfr__));
#define ALCFGRPT ALCFGRPT
extern volatile uint16_t ALCFGRPT __attribute__((__sfr__));
__extension__ typedef struct tagALCFGRPTBITS {
  union {
    struct {
      uint16_t ARPT:8;
      uint16_t ALRMPTR:2;
      uint16_t AMASK:4;
      uint16_t CHIME:1;
      uint16_t ALRMEN:1;
    };
    struct {
      uint16_t ARPT0:1;
      uint16_t ARPT1:1;
      uint16_t ARPT2:1;
      uint16_t ARPT3:1;
      uint16_t ARPT4:1;
      uint16_t ARPT5:1;
      uint16_t ARPT6:1;
      uint16_t ARPT7:1;
      uint16_t ALRMPTR0:1;
      uint16_t ALRMPTR1:1;
      uint16_t AMASK0:1;
      uint16_t AMASK1:1;
      uint16_t AMASK2:1;
      uint16_t AMASK3:1;
    };
  };
} ALCFGRPTBITS;
extern volatile ALCFGRPTBITS ALCFGRPTbits __attribute__((__sfr__));

#define RTCVAL RTCVAL
extern volatile uint16_t RTCVAL __attribute__((__sfr__));
#define RCFGCAL RCFGCAL
extern volatile uint16_t RCFGCAL __attribute__((__sfr__));
__extension__ typedef struct tagRCFGCALBITS {
  union {
    struct {
      uint16_t CAL:8;
      uint16_t RTCPTR:2;
      uint16_t RTCOE:1;
      uint16_t HALFSEC:1;
      uint16_t RTCSYNC:1;
      uint16_t RTCWREN:1;
      uint16_t :1;
      uint16_t RTCEN:1;
    };
    struct {
      uint16_t CAL0:1;
      uint16_t CAL1:1;
      uint16_t CAL2:1;
      uint16_t CAL3:1;
      uint16_t CAL4:1;
      uint16_t CAL5:1;
      uint16_t CAL6:1;
      uint16_t CAL7:1;
      uint16_t RTCPTR0:1;
      uint16_t RTCPTR1:1;
    };
  };
} RCFGCALBITS;
extern volatile RCFGCALBITS RCFGCALbits __attribute__((__sfr__));

#define CRCCON1 CRCCON1
extern volatile uint16_t CRCCON1 __attribute__((__sfr__));
__extension__ typedef struct tagCRCCON1BITS {
  union {
    struct {
      uint16_t :3;
      uint16_t LENDIAN:1;
      uint16_t CRCGO:1;
      uint16_t CRCISEL:1;
      uint16_t CRCMPT:1;
      uint16_t CRCFUL:1;
      uint16_t VWORD:5;
      uint16_t CSIDL:1;
      uint16_t :1;
      uint16_t CRCEN:1;
    };
    struct {
      uint16_t :8;
      uint16_t VWORD0:1;
      uint16_t VWORD1:1;
      uint16_t VWORD2:1;
      uint16_t VWORD3:1;
      uint16_t VWORD4:1;
    };
  };
} CRCCON1BITS;
extern volatile CRCCON1BITS CRCCON1bits __attribute__((__sfr__));

#define CRCCON2 CRCCON2
extern volatile uint16_t CRCCON2 __attribute__((__sfr__));
__extension__ typedef struct tagCRCCON2BITS {
  union {
    struct {
      uint16_t PLEN:5;
      uint16_t :3;
      uint16_t DWIDTH:5;
    };
    struct {
      uint16_t PLEN0:1;
      uint16_t PLEN1:1;
      uint16_t PLEN2:1;
      uint16_t PLEN3:1;
      uint16_t PLEN4:1;
      uint16_t :3;
      uint16_t DWIDTH0:1;
      uint16_t DWIDTH1:1;
      uint16_t DWIDTH2:1;
      uint16_t DWIDTH3:1;
      uint16_t DWIDTH4:1;
    };
  };
} CRCCON2BITS;
extern volatile CRCCON2BITS CRCCON2bits __attribute__((__sfr__));

