MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256GM304/mcu.h
#define _IEC3_QEI1IE_POSITION                    0x0000000A
#define _IEC3_QEI1IE_MASK                        0x00000400
#define _IEC3_QEI1IE_LENGTH                      0x00000001

#define _IEC3_DCIEIE_POSITION                    0x0000000B
#define _IEC3_DCIEIE_MASK                        0x00000800
#define _IEC3_DCIEIE_LENGTH                      0x00000001

#define _IEC3_DCIIE_POSITION                     0x0000000C
#define _IEC3_DCIIE_MASK                         0x00001000
#define _IEC3_DCIIE_LENGTH                       0x00000001

#define _IEC3_RTCCIE_POSITION                    0x0000000E
#define _IEC3_RTCCIE_MASK                        0x00004000
#define _IEC3_RTCCIE_LENGTH                      0x00000001

#define _IEC4_U1EIE_POSITION                     0x00000001
#define _IEC4_U1EIE_MASK                         0x00000002
#define _IEC4_U1EIE_LENGTH                       0x00000001

#define _IEC4_U2EIE_POSITION                     0x00000002
#define _IEC4_U2EIE_MASK                         0x00000004
#define _IEC4_U2EIE_LENGTH                       0x00000001

#define _IEC4_CRCIE_POSITION                     0x00000003
#define _IEC4_CRCIE_MASK                         0x00000008
#define _IEC4_CRCIE_LENGTH                       0x00000001

#define _IEC4_PSESMIE_POSITION                   0x00000009
#define _IEC4_PSESMIE_MASK                       0x00000200
#define _IEC4_PSESMIE_LENGTH                     0x00000001

#define _IEC4_QEI2IE_POSITION                    0x0000000B
#define _IEC4_QEI2IE_MASK                        0x00000800
#define _IEC4_QEI2IE_LENGTH                      0x00000001

#define _IEC4_CTMUIE_POSITION                    0x0000000D
#define _IEC4_CTMUIE_MASK                        0x00002000
#define _IEC4_CTMUIE_LENGTH                      0x00000001

#define _IEC5_U3EIE_POSITION                     0x00000001
#define _IEC5_U3EIE_MASK                         0x00000002
#define _IEC5_U3EIE_LENGTH                       0x00000001

#define _IEC5_U3RXIE_POSITION                    0x00000002
#define _IEC5_U3RXIE_MASK                        0x00000004
#define _IEC5_U3RXIE_LENGTH                      0x00000001

#define _IEC5_U3TXIE_POSITION                    0x00000003
#define _IEC5_U3TXIE_MASK                        0x00000008
#define _IEC5_U3TXIE_LENGTH                      0x00000001

#define _IEC5_U4EIE_POSITION                     0x00000007
#define _IEC5_U4EIE_MASK                         0x00000080
#define _IEC5_U4EIE_LENGTH                       0x00000001

#define _IEC5_U4RXIE_POSITION                    0x00000008
#define _IEC5_U4RXIE_MASK                        0x00000100
#define _IEC5_U4RXIE_LENGTH                      0x00000001

#define _IEC5_U4TXIE_POSITION                    0x00000009
#define _IEC5_U4TXIE_MASK                        0x00000200
#define _IEC5_U4TXIE_LENGTH                      0x00000001

#define _IEC5_SPI3EIE_POSITION                   0x0000000A
#define _IEC5_SPI3EIE_MASK                       0x00000400
#define _IEC5_SPI3EIE_LENGTH                     0x00000001

#define _IEC5_SPI3IE_POSITION                    0x0000000B
#define _IEC5_SPI3IE_MASK                        0x00000800
#define _IEC5_SPI3IE_LENGTH                      0x00000001

#define _IEC5_PWM1IE_POSITION                    0x0000000E
#define _IEC5_PWM1IE_MASK                        0x00004000
#define _IEC5_PWM1IE_LENGTH                      0x00000001

#define _IEC5_PWM2IE_POSITION                    0x0000000F
#define _IEC5_PWM2IE_MASK                        0x00008000
#define _IEC5_PWM2IE_LENGTH                      0x00000001

#define _IEC6_PWM3IE_POSITION                    0x00000000
#define _IEC6_PWM3IE_MASK                        0x00000001
#define _IEC6_PWM3IE_LENGTH                      0x00000001

#define _IEC6_PWM4IE_POSITION                    0x00000001
#define _IEC6_PWM4IE_MASK                        0x00000002
#define _IEC6_PWM4IE_LENGTH                      0x00000001

#define _IEC6_PWM5IE_POSITION                    0x00000002
#define _IEC6_PWM5IE_MASK                        0x00000004
#define _IEC6_PWM5IE_LENGTH                      0x00000001

#define _IEC6_PWM6IE_POSITION                    0x00000003
#define _IEC6_PWM6IE_MASK                        0x00000008
#define _IEC6_PWM6IE_LENGTH                      0x00000001

#define _IEC8_ICDIE_POSITION                     0x0000000E
#define _IEC8_ICDIE_MASK                         0x00004000
#define _IEC8_ICDIE_LENGTH                       0x00000001

#define _IEC8_JTAGIE_POSITION                    0x0000000F
#define _IEC8_JTAGIE_MASK                        0x00008000
#define _IEC8_JTAGIE_LENGTH                      0x00000001

#define _IEC9_PTGSTEPIE_POSITION                 0x00000001
#define _IEC9_PTGSTEPIE_MASK                     0x00000002
#define _IEC9_PTGSTEPIE_LENGTH                   0x00000001

#define _IEC9_PTGWDTIE_POSITION                  0x00000002
#define _IEC9_PTGWDTIE_MASK                      0x00000004
#define _IEC9_PTGWDTIE_LENGTH                    0x00000001

#define _IEC9_PTG0IE_POSITION                    0x00000003
#define _IEC9_PTG0IE_MASK                        0x00000008
#define _IEC9_PTG0IE_LENGTH                      0x00000001

#define _IEC9_PTG1IE_POSITION                    0x00000004
#define _IEC9_PTG1IE_MASK                        0x00000010
#define _IEC9_PTG1IE_LENGTH                      0x00000001

#define _IEC9_PTG2IE_POSITION                    0x00000005
#define _IEC9_PTG2IE_MASK                        0x00000020
#define _IEC9_PTG2IE_LENGTH                      0x00000001

#define _IEC9_PTG3IE_POSITION                    0x00000006
#define _IEC9_PTG3IE_MASK                        0x00000040
#define _IEC9_PTG3IE_LENGTH                      0x00000001

#define _IPC0_INT0IP_POSITION                    0x00000000
#define _IPC0_INT0IP_MASK                        0x00000007
#define _IPC0_INT0IP_LENGTH                      0x00000003

#define _IPC0_IC1IP_POSITION                     0x00000004
#define _IPC0_IC1IP_MASK                         0x00000070
#define _IPC0_IC1IP_LENGTH                       0x00000003

#define _IPC0_OC1IP_POSITION                     0x00000008
#define _IPC0_OC1IP_MASK                         0x00000700
#define _IPC0_OC1IP_LENGTH                       0x00000003

#define _IPC0_T1IP_POSITION                      0x0000000C
#define _IPC0_T1IP_MASK                          0x00007000
#define _IPC0_T1IP_LENGTH                        0x00000003

#define _IPC0_INT0IP0_POSITION                   0x00000000
#define _IPC0_INT0IP0_MASK                       0x00000001
#define _IPC0_INT0IP0_LENGTH                     0x00000001

#define _IPC0_INT0IP1_POSITION                   0x00000001
#define _IPC0_INT0IP1_MASK                       0x00000002
#define _IPC0_INT0IP1_LENGTH                     0x00000001

